This is an org mode file containing Emacs Lisp ➿ (and for teaching/comparison purposes, some Python 🐍) code for the advent of code problems.

The *code is introduced in snippets* 💬, and the *complete code is available together at the end of each day* 📚.

🚀  *NOTE: If viewing in Github, using the "outline" mode may be helpful!* 👁 🪰🦉🐐🕮🔔🍑

* Table of Contents                                                     :TOC_3:
- [[#day-1][Day 1]]
  - [[#part-1][Part 1]]
    - [[#first-create-a-list-of-numbers-from-the-text-input][First, create a list of numbers, from the text input]]
    - [[#split-the-raw-input-into-two-lists][Split the raw input into two lists]]
    - [[#sort-the-lists][Sort the lists]]
    - [[#compute-the-sum-of-the-differences][Compute the sum of the differences]]
  - [[#part-2][Part 2]]
  - [[#full-code][Full code]]
- [[#day-2][Day 2]]
  - [[#part-1-1][Part 1]]
    - [[#long-input-code][Long Input Code]]
    - [[#claude-solution][Claude Solution]]
- [[#part-2-1][Part 2]]
  - [[#note-on-thereis-syntax-of-the-cl-loop-macro-from-emacs-common-lisp-lisp-emulation-manual-cliteration-clauses][Note on =thereis= syntax of the =cl-loop= macro, from Emacs Common Lisp Lisp Emulation Manual cl#Iteration Clauses]]
  - [[#explanation][Explanation]]
  - [[#full-code-1][Full Code]]

* Day 1
** Part 1
*** First, create a list of numbers, from the text input

Python lists:
#+begin_src python
my_list = [1, 2, 3]
#+end_src

Emacs lists:
#+begin_src elisp
(setq my_list '(1 2 3))
#+end_src

**** Long input code
:PROPERTIES:
:VISIBILITY: folded
:END:
#+begin_src elisp
(setq raw_input '(
82728   61150
39850   94024
24609   43406
24964   98661
16230   17299
29827   43603
52378   90132
15961   90132
48209   97422
90738   75302
50850   18024
83479   94024
91264   72109
66553   64129
39685   55155
31946   67583
39808   34091
45133   43008
57938   97422
70650   78635
40085   43526
82147   44804
48132   11603
36805   26938
95935   52745
43007   59992
64997   70247
16361   24737
77467   35575
88430   84124
40863   81976
85989   33349
64698   77416
63392   63630
32665   89542
82943   39849
91491   97422
96858   17299
88128   75447
82315   83417
12263   29681
56902   35541
16051   55031
41613   70247
48481   82123
39670   89542
31830   94024
93702   46875
27322   97674
77697   38394
12569   43603
35225   13575
59674   47405
18319   89542
88626   68373
26170   74493
70247   91908
38965   28783
52976   51470
15339   80450
72244   13084
46476   91257
11615   43109
92556   35200
30522   17599
52667   55031
61811   24081
15611   55031
31461   62239
36424   16768
92745   44773
10246   50548
86509   28934
45418   78893
45156   63696
95535   55031
16691   96423
43778   43603
71564   52518
87002   81976
94024   83359
20893   60991
62456   35753
33024   85311
66867   44981
61522   43603
16128   43603
41863   94024
88684   33301
59882   95399
70842   13159
62709   16215
16058   48454
67232   35375
62624   16768
47204   53486
81027   66508
76530   49287
25749   46116
81620   45156
71662   77019
80092   68967
19088   31955
40308   81976
39855   90825
93549   88660
71622   81450
64422   30851
43828   60702
77801   90810
13925   91184
51830   83830
12507   26391
50014   45156
56843   97422
57063   17118
37260   38582
94363   18325
58862   23200
57703   82014
33084   64836
51041   69435
97254   51941
35644   43603
18669   57530
56890   23054
31788   80735
54517   89542
52172   29681
50286   17299
96866   94024
56782   91820
25469   18254
33882   20182
56421   31746
91215   40070
83847   64836
62253   94024
94121   60848
98477   21613
37590   85421
25770   14916
59401   59921
73382   51470
58149   62768
54118   22482
59395   59921
63746   81450
94883   13575
50314   29681
93858   82015
27751   54143
26917   35753
81996   23054
71969   93265
30553   20135
77288   83737
79468   95847
30637   31173
57832   95779
29795   13575
71371   94024
27972   69030
43433   55031
45878   97422
74042   95825
38197   69071
63067   45758
76552   65255
86156   64724
19492   46293
52089   69521
66789   34079
82613   42340
20542   18205
22143   14916
73968   89542
40335   45290
92711   51470
19146   94024
53047   13284
49843   25804
96430   95399
98633   90132
50516   43603
23379   25467
35212   73008
22440   61796
51478   40724
81249   43603
53260   51470
83243   59921
92917   90132
53224   95399
83043   51275
79555   63244
70751   64836
84246   97100
46769   16885
59806   13284
20614   60848
81232   23902
59959   16768
37902   14331
29562   55031
52097   81976
24953   58343
17261   55031
54502   99896
96242   48343
37556   81450
18272   60848
66670   19012
83198   80333
23519   95399
17886   38271
16359   99341
40648   33892
77114   77385
36008   71553
79769   60848
47199   13575
46285   88410
23880   81943
57491   98108
98778   27568
21135   25456
96914   81450
78774   13575
63430   45001
87607   65255
29550   16633
93138   95399
53884   94498
29227   55031
11378   97422
73168   92972
28560   40280
58428   30760
85756   94197
51545   77019
40374   13431
96538   64836
70888   85369
96291   70247
87918   64137
76493   52966
88843   60854
92908   65255
39225   81310
70001   56892
76446   24595
85220   81450
58580   43167
97422   29681
61228   64836
28019   70247
90150   43603
51935   95924
90430   86513
84890   89326
45758   74544
33282   70247
35203   36593
81450   12273
99714   31653
62192   43603
48547   64836
81976   13575
58583   13431
14066   12887
62207   42508
86711   13431
36650   44019
57249   40786
80718   64836
63471   14916
71861   55031
68757   14916
41204   17299
66794   98207
95829   45758
83965   43978
87160   29681
49557   81901
61775   92631
43971   24451
95603   70593
68672   97422
99669   13325
24435   61844
73318   89542
54617   69071
71223   17299
55314   97422
93737   46194
47491   93916
34979   79658
77019   81976
61998   77019
45142   79564
58057   77878
77811   68285
67567   46867
75736   90132
35995   64599
69522   24241
74746   91359
76546   13431
61686   60848
81479   56819
86234   46898
17684   14916
54606   36671
91078   14916
87613   81450
68950   29904
92860   29681
97548   26634
94120   46867
65885   51516
93925   71162
65057   13284
47652   75587
90143   16768
22958   13575
19110   56571
90991   86313
86342   49453
13474   89542
39258   60854
32081   78421
59662   60854
77568   24365
26287   64963
73097   56013
65459   97422
15222   20848
94198   46293
31524   54464
62524   13431
63731   23054
94492   58590
39340   89542
98341   94382
87046   14916
54817   73805
92197   79829
75996   81752
15843   51151
81860   91508
97487   81450
55465   45279
98617   72612
41836   15262
96431   59346
68321   24649
44222   14916
12305   26436
26128   43083
49032   45758
32611   59921
16984   83584
79976   81450
53906   65866
28125   40953
79829   13431
71094   66024
15262   74605
10894   73112
33135   25114
73835   81176
92084   51692
99655   48595
26871   78248
21930   46867
11939   95399
50426   27946
84499   46293
76605   21967
70366   70247
23875   11765
29040   23054
65978   70247
65316   81976
78274   57844
19602   36987
59993   45758
61413   40822
95133   15262
60391   17299
56884   20462
32017   86368
61814   70068
36780   50859
34229   89542
96617   14382
16265   64992
68054   57606
41854   27907
87505   25772
82921   13575
29611   51470
64836   77139
12016   94024
25898   90132
39759   40921
70322   28732
16957   97215
80739   20405
42783   59243
53327   35753
60939   93730
65608   21723
51615   77019
42372   60225
82865   62922
51705   13575
60517   44646
32859   49938
65056   65110
66014   59518
95374   69071
62688   45758
19612   34764
14898   91359
35158   84040
46004   51534
12662   84719
59241   22568
50371   69943
66714   13864
32091   90159
27889   21234
21486   43277
91705   71361
43597   78281
96488   23720
16085   91359
84801   65255
17302   77019
35657   34340
89315   10686
56279   81976
14916   91359
55031   17299
99549   45758
69322   42820
15753   54646
13910   81943
10622   60854
89542   16187
45934   58213
25961   23054
73079   81694
73577   61502
11146   72825
41762   68244
75839   64836
54839   56505
42362   93709
23054   45156
41434   22280
68919   81976
51470   35694
82925   95399
52548   82748
77271   49843
77587   13575
58491   73903
90544   70247
97483   43603
92561   80709
37349   35639
81533   23054
16921   67801
54482   57089
55983   20574
18017   47405
91613   94024
28936   87183
94041   56294
97989   65255
74053   31819
12545   55980
82508   23054
16768   46293
68704   47565
79617   47405
41459   81943
88096   43603
59389   13284
24842   81976
13968   67491
46198   81943
15283   65255
49913   17088
10405   14916
92804   62365
76765   79391
54682   68981
33524   18156
76148   23054
66461   77019
33406   94024
51127   34897
23852   13284
72435   81607
26294   77019
42775   13961
75922   97390
47133   87320
36766   95060
30569   95399
27931   19111
54334   29670
40819   18317
70620   90199
65626   93032
53032   31988
80476   13284
26777   11497
56970   23054
40175   89542
76426   77019
25173   94024
87181   95399
51275   77019
16447   63367
81943   50854
10254   78936
75282   45758
60082   23054
64998   79829
49070   13431
56755   52197
69071   73076
75338   17299
75541   29541
90443   88931
89908   84016
13663   62808
36653   13284
49672   67563
55603   11156
66603   64971
88089   13284
42518   72738
63672   65255
46069   92788
35113   47405
25531   68032
55846   41799
68911   99772
97864   43603
67936   13284
64842   97422
95511   77019
53067   70247
33019   65117
48961   89542
91310   82114
81303   13284
21127   46293
55847   81943
49862   95399
90703   91620
51583   59242
95384   44667
71879   10528
51111   51072
73704   64836
67917   43603
90318   65645
38668   46293
58760   48017
46625   81450
31014   94197
60854   97422
37481   81450
49181   89542
94558   82318
88224   74894
33578   38935
17470   47295
97321   73090
14158   29681
71896   90132
37567   30968
13543   84125
56076   69071
17520   97422
13731   83298
64073   13431
79501   48002
15814   81943
22828   54359
82055   70247
45012   81943
65118   34203
27935   71093
72534   90132
67283   90132
94197   96436
11632   43603
57374   23054
88992   75593
40356   22369
55831   13431
21812   65255
13044   46867
61280   28505
93877   81976
97018   47932
39895   66100
94335   13575
43867   43722
91800   13284
39295   59394
37827   91359
43381   46913
12882   10753
99546   14556
69726   83158
92017   45758
92576   85933
82806   99520
95240   16049
73226   75691
95399   75289
41658   13284
32251   72477
21150   81976
25532   89542
68624   43603
99988   47405
28545   73762
47911   14241
10006   45084
70869   97422
76635   17299
74980   16768
29665   32846
22260   13284
83589   16768
12297   43603
94460   30815
14367   74187
48459   78588
48094   14916
64554   34585
40966   15981
55992   68759
56286   64836
91359   58182
37712   46867
10002   27220
35390   51119
79851   27599
28003   29681
11126   81943
77889   56829
21290   65255
12281   42665
58526   23054
96441   43603
32713   24189
11803   69829
15808   15511
87150   87399
61028   69071
43603   18973
49827   13284
79374   17299
63980   46293
35321   91359
63092   77019
93950   81943
61348   98676
67412   26112
88625   61556
82756   46867
61980   51275
33183   15153
82717   54552
10272   69791
90197   85585
66042   81450
87499   55031
22891   59921
19636   87817
14035   89514
44978   72496
66453   83959
35532   21026
90326   76422
45538   14916
58391   45699
68240   23054
17327   17309
54811   36357
29411   13575
19772   20557
55843   19650
34136   23054
35640   80932
31022   13284
51453   17849
59415   73413
47405   60585
24554   59847
16449   77019
84635   13284
71150   79399
91304   45758
16316   45156
24372   65255
51800   56078
25967   56557
10335   13575
26500   61450
21511   65255
47266   52620
51507   36666
43522   16768
13302   60048
28720   13431
27828   60848
17916   65255
27845   63254
60848   90132
15202   26716
21780   50888
45198   50172
15593   56206
84399   81976
84383   97422
45107   50570
55693   45156
61697   77864
40967   99041
12361   81976
85195   10836
23903   59921
75889   63849
85462   69833
55277   98966
99467   16768
80545   92826
97028   13431
49543   58198
79679   81450
37768   14916
49987   43592
52388   81391
49705   31727
97337   89542
65261   15228
32193   23798
96980   56609
55973   96548
43554   54178
14385   53532
13284   52896
31417   79377
39843   40105
47537   60848
97596   94197
92481   23651
32979   91359
20137   44731
32782   77019
97715   14916
36171   73797
52352   77019
65624   70034
43735   94024
32065   81450
37801   70247
57260   91182
58699   22228
46293   95695
88201   51470
65421   70247
98471   80000
97663   91359
29825   40467
36280   83692
63395   93834
13431   46293
65598   56325
45294   58994
36392   13431
48817   70247
42632   14916
75814   12534
79015   29681
63583   14222
21811   65255
15712   77019
82774   94024
25558   87504
40351   82954
66201   41337
17467   13431
25618   78048
21325   93477
48070   23054
71739   44215
22764   14916
70342   81976
61768   43603
90132   31672
35753   85115
87424   95399
44506   59921
58439   69764
91737   43091
84038   85175
34169   32959
57299   67053
16078   55031
94423   45156
12025   76644
49243   35658
24206   76815
19466   68123
36271   16768
20805   59921
44320   90492
55138   64836
80603   45758
80337   30227
59921   67830
95013   23975
42358   45118
60271   62795
91829   14916
72118   81976
42079   64836
29714   47405
75024   69180
97698   17299
53871   60848
32772   94024
23136   69263
65014   13284
99723   70247
10739   69071
96656   20261
77088   64836
60997   27431
16566   59892
34855   71849
13575   43778
10925   81943
41426   38747
45792   91359
77266   13575
54453   89542
26345   88825
45204   69926
22055   70247
66184   45758
89954   13284
76966   78245
16756   75144
35954   13431
41534   55700
34625   25112
16484   27791
13180   43603
72476   26272
56865   44266
29214   52239
48021   13137
85762   56515
11530   14094
25191   46867
40256   27805
42575   35753
78015   89542
79395   36014
51976   60848
91540   78975
15438   29681
83498   13575
70566   28673
78791   46293
40988   46249
84968   15198
12950   51470
43049   40408
29441   17880
33283   29681
45021   77019
19403   60496
37671   13897
52800   46293
65255   73346
19007   78906
61032   95399
41062   99758
58160   16768
16220   49027
10787   64836
55534   70247
32708   17299
26862   17299
32335   46867
46693   23383
24824   75634
21313   80071
53841   35488
76356   81943
10703   43632
82980   98849
11274   88022
68390   65255
45798   90132
66426   37716
27073   81077
40291   57328
76494   71247
44324   90132
15572   62595
67578   19687
59765   81976
29681   81450
24923   60526
63193   28900
68670   81943
21643   55031
17767   98815
70739   17299
77675   64144
65919   70247
86115   35753
35921   70247
35695   95399
17571   90132
10776   23054
55618   19388
23004   60854
35209   81976
70656   48543
28799   13575
62772   16890
88333   35753
89689   12805
96145   16768
44732   79829
41319   70247
17299   81450
48321   81450
60541   32436
98932   47405
50849   27716
81857   62305
64010   89156
34841   99387
27063   83357
73447   64896
83334   29681
44937   87174
59004   13575
17881   49843
71379   50689
92853   47405
32440   91359
88509   13575
29889   42477
83016   14916
34898   19758
43489   89542
26612   13575
58720   93232
63399   16768
46867   29681
23466   17299
63419   70636
53408   34371
66651   75494
44058   18000
13953   81450
69061   13284
92526   15134
69474   97422
56975   26225
94591   26288
20141   33683
84695   17299
14687   79829
34338   64836
26755   89542
11290   21632
30499   83141
52953   16639
78106   31125
44897   79242))
#+end_src

#+RESULTS:
| 82728 | 61150 | 39850 | 94024 | 24609 | 43406 | 24964 | 98661 | 16230 | 17299 | 29827 | 43603 | 52378 | 90132 | 15961 | 90132 | 48209 | 97422 | 90738 | 75302 | 50850 | 18024 | 83479 | 94024 | 91264 | 72109 | 66553 | 64129 | 39685 | 55155 | 31946 | 67583 | 39808 | 34091 | 45133 | 43008 | 57938 | 97422 | 70650 | 78635 | 40085 | 43526 | 82147 | 44804 | 48132 | 11603 | 36805 | 26938 | 95935 | 52745 | 43007 | 59992 | 64997 | 70247 | 16361 | 24737 | 77467 | 35575 | 88430 | 84124 | 40863 | 81976 | 85989 | 33349 | 64698 | 77416 | 63392 | 63630 | 32665 | 89542 | 82943 | 39849 | 91491 | 97422 | 96858 | 17299 | 88128 | 75447 | 82315 | 83417 | 12263 | 29681 | 56902 | 35541 | 16051 | 55031 | 41613 | 70247 | 48481 | 82123 | 39670 | 89542 | 31830 | 94024 | 93702 | 46875 | 27322 | 97674 | 77697 | 38394 | 12569 | 43603 | 35225 | 13575 | 59674 | 47405 | 18319 | 89542 | 88626 | 68373 | 26170 | 74493 | 70247 | 91908 | 38965 | 28783 | 52976 | 51470 | 15339 | 80450 | 72244 | 13084 | 46476 | 91257 | 11615 | 43109 | 92556 | 35200 | 30522 | 17599 | 52667 | 55031 | 61811 | 24081 | 15611 | 55031 | 31461 | 62239 | 36424 | 16768 | 92745 | 44773 | 10246 | 50548 | 86509 | 28934 | 45418 | 78893 | 45156 | 63696 | 95535 | 55031 | 16691 | 96423 | 43778 | 43603 | 71564 | 52518 | 87002 | 81976 | 94024 | 83359 | 20893 | 60991 | 62456 | 35753 | 33024 | 85311 | 66867 | 44981 | 61522 | 43603 | 16128 | 43603 | 41863 | 94024 | 88684 | 33301 | 59882 | 95399 | 70842 | 13159 | 62709 | 16215 | 16058 | 48454 | 67232 | 35375 | 62624 | 16768 | 47204 | 53486 | 81027 | 66508 | 76530 | 49287 | 25749 | 46116 | 81620 | 45156 | 71662 | 77019 | 80092 | 68967 | 19088 | 31955 | 40308 | 81976 | 39855 | 90825 | 93549 | 88660 | 71622 | 81450 | 64422 | 30851 | 43828 | 60702 | 77801 | 90810 | 13925 | 91184 | 51830 | 83830 | 12507 | 26391 | 50014 | 45156 | 56843 | 97422 | 57063 | 17118 | 37260 | 38582 | 94363 | 18325 | 58862 | 23200 | 57703 | 82014 | 33084 | 64836 | 51041 | 69435 | 97254 | 51941 | 35644 | 43603 | 18669 | 57530 | 56890 | 23054 | 31788 | 80735 | 54517 | 89542 | 52172 | 29681 | 50286 | 17299 | 96866 | 94024 | 56782 | 91820 | 25469 | 18254 | 33882 | 20182 | 56421 | 31746 | 91215 | 40070 | 83847 | 64836 | 62253 | 94024 | 94121 | 60848 | 98477 | 21613 | 37590 | 85421 | 25770 | 14916 | 59401 | 59921 | 73382 | 51470 | 58149 | 62768 | 54118 | 22482 | 59395 | 59921 | 63746 | 81450 | 94883 | 13575 | 50314 | 29681 | 93858 | 82015 | 27751 | 54143 | 26917 | 35753 | 81996 | 23054 | 71969 | 93265 | 30553 | 20135 | 77288 | 83737 | 79468 | 95847 | 30637 | 31173 | 57832 | 95779 | 29795 | 13575 | 71371 | 94024 | 27972 | 69030 | 43433 | 55031 | 45878 | 97422 | 74042 | 95825 | 38197 | 69071 | 63067 | 45758 | 76552 | 65255 | 86156 | 64724 | 19492 | 46293 | 52089 | 69521 | 66789 | 34079 | 82613 | 42340 | 20542 | 18205 | 22143 | 14916 | 73968 | 89542 | 40335 | 45290 | 92711 | 51470 | 19146 | 94024 | 53047 | 13284 | 49843 | 25804 | 96430 | 95399 | 98633 | 90132 | 50516 | 43603 | 23379 | 25467 | 35212 | 73008 | 22440 | 61796 | 51478 | 40724 | 81249 | 43603 | 53260 | 51470 | 83243 | 59921 | 92917 | 90132 | 53224 | 95399 | 83043 | 51275 | 79555 | 63244 | 70751 | 64836 | 84246 | 97100 | 46769 | 16885 | 59806 | 13284 | 20614 | 60848 | 81232 | 23902 | 59959 | 16768 | 37902 | 14331 | 29562 | 55031 | 52097 | 81976 | 24953 | 58343 | 17261 | 55031 | 54502 | 99896 | 96242 | 48343 | 37556 | 81450 | 18272 | 60848 | 66670 | 19012 | 83198 | 80333 | 23519 | 95399 | 17886 | 38271 | 16359 | 99341 | 40648 | 33892 | 77114 | 77385 | 36008 | 71553 | 79769 | 60848 | 47199 | 13575 | 46285 | 88410 | 23880 | 81943 | 57491 | 98108 | 98778 | 27568 | 21135 | 25456 | 96914 | 81450 | 78774 | 13575 | 63430 | 45001 | 87607 | 65255 | 29550 | 16633 | 93138 | 95399 | 53884 | 94498 | 29227 | 55031 | 11378 | 97422 | 73168 | 92972 | 28560 | 40280 | 58428 | 30760 | 85756 | 94197 | 51545 | 77019 | 40374 | 13431 | 96538 | 64836 | 70888 | 85369 | 96291 | 70247 | 87918 | 64137 | 76493 | 52966 | 88843 | 60854 | 92908 | 65255 | 39225 | 81310 | 70001 | 56892 | 76446 | 24595 | 85220 | 81450 | 58580 | 43167 | 97422 | 29681 | 61228 | 64836 | 28019 | 70247 | 90150 | 43603 | 51935 | 95924 | 90430 | 86513 | 84890 | 89326 | 45758 | 74544 | 33282 | 70247 | 35203 | 36593 | 81450 | 12273 | 99714 | 31653 | 62192 | 43603 | 48547 | 64836 | 81976 | 13575 | 58583 | 13431 | 14066 | 12887 | 62207 | 42508 | 86711 | 13431 | 36650 | 44019 | 57249 | 40786 | 80718 | 64836 | 63471 | 14916 | 71861 | 55031 | 68757 | 14916 | 41204 | 17299 | 66794 | 98207 | 95829 | 45758 | 83965 | 43978 | 87160 | 29681 | 49557 | 81901 | 61775 | 92631 | 43971 | 24451 | 95603 | 70593 | 68672 | 97422 | 99669 | 13325 | 24435 | 61844 | 73318 | 89542 | 54617 | 69071 | 71223 | 17299 | 55314 | 97422 | 93737 | 46194 | 47491 | 93916 | 34979 | 79658 | 77019 | 81976 | 61998 | 77019 | 45142 | 79564 | 58057 | 77878 | 77811 | 68285 | 67567 | 46867 | 75736 | 90132 | 35995 | 64599 | 69522 | 24241 | 74746 | 91359 | 76546 | 13431 | 61686 | 60848 | 81479 | 56819 | 86234 | 46898 | 17684 | 14916 | 54606 | 36671 | 91078 | 14916 | 87613 | 81450 | 68950 | 29904 | 92860 | 29681 | 97548 | 26634 | 94120 | 46867 | 65885 | 51516 | 93925 | 71162 | 65057 | 13284 | 47652 | 75587 | 90143 | 16768 | 22958 | 13575 | 19110 | 56571 | 90991 | 86313 | 86342 | 49453 | 13474 | 89542 | 39258 | 60854 | 32081 | 78421 | 59662 | 60854 | 77568 | 24365 | 26287 | 64963 | 73097 | 56013 | 65459 | 97422 | 15222 | 20848 | 94198 | 46293 | 31524 | 54464 | 62524 | 13431 | 63731 | 23054 | 94492 | 58590 | 39340 | 89542 | 98341 | 94382 | 87046 | 14916 | 54817 | 73805 | 92197 | 79829 | 75996 | 81752 | 15843 | 51151 | 81860 | 91508 | 97487 | 81450 | 55465 | 45279 | 98617 | 72612 | 41836 | 15262 | 96431 | 59346 | 68321 | 24649 | 44222 | 14916 | 12305 | 26436 | 26128 | 43083 | 49032 | 45758 | 32611 | 59921 | 16984 | 83584 | 79976 | 81450 | 53906 | 65866 | 28125 | 40953 | 79829 | 13431 | 71094 | 66024 | 15262 | 74605 | 10894 | 73112 | 33135 | 25114 | 73835 | 81176 | 92084 | 51692 | 99655 | 48595 | 26871 | 78248 | 21930 | 46867 | 11939 | 95399 | 50426 | 27946 | 84499 | 46293 | 76605 | 21967 | 70366 | 70247 | 23875 | 11765 | 29040 | 23054 | 65978 | 70247 | 65316 | 81976 | 78274 | 57844 | 19602 | 36987 | 59993 | 45758 | 61413 | 40822 | 95133 | 15262 | 60391 | 17299 | 56884 | 20462 | 32017 | 86368 | 61814 | 70068 | 36780 | 50859 | 34229 | 89542 | 96617 | 14382 | 16265 | 64992 | 68054 | 57606 | 41854 | 27907 | 87505 | 25772 | 82921 | 13575 | 29611 | 51470 | 64836 | 77139 | 12016 | 94024 | 25898 | 90132 | 39759 | 40921 | 70322 | 28732 | 16957 | 97215 | 80739 | 20405 | 42783 | 59243 | 53327 | 35753 | 60939 | 93730 | 65608 | 21723 | 51615 | 77019 | 42372 | 60225 | 82865 | 62922 | 51705 | 13575 | 60517 | 44646 | 32859 | 49938 | 65056 | 65110 | 66014 | 59518 | 95374 | 69071 | 62688 | 45758 | 19612 | 34764 | 14898 | 91359 | 35158 | 84040 | 46004 | 51534 | 12662 | 84719 | 59241 | 22568 | 50371 | 69943 | 66714 | 13864 | 32091 | 90159 | 27889 | 21234 | 21486 | 43277 | 91705 | 71361 | 43597 | 78281 | 96488 | 23720 | 16085 | 91359 | 84801 | 65255 | 17302 | 77019 | 35657 | 34340 | 89315 | 10686 | 56279 | 81976 | 14916 | 91359 | 55031 | 17299 | 99549 | 45758 | 69322 | 42820 | 15753 | 54646 | 13910 | 81943 | 10622 | 60854 | 89542 | 16187 | 45934 | 58213 | 25961 | 23054 | 73079 | 81694 | 73577 | 61502 | 11146 | 72825 | 41762 | 68244 | 75839 | 64836 | 54839 | 56505 | 42362 | 93709 | 23054 | 45156 | 41434 | 22280 | 68919 | 81976 | 51470 | 35694 | 82925 | 95399 | 52548 | 82748 | 77271 | 49843 | 77587 | 13575 | 58491 | 73903 | 90544 | 70247 | 97483 | 43603 | 92561 | 80709 | 37349 | 35639 | 81533 | 23054 | 16921 | 67801 | 54482 | 57089 | 55983 | 20574 | 18017 | 47405 | 91613 | 94024 | 28936 | 87183 | 94041 | 56294 | 97989 | 65255 | 74053 | 31819 | 12545 | 55980 | 82508 | 23054 | 16768 | 46293 | 68704 | 47565 | 79617 | 47405 | 41459 | 81943 | 88096 | 43603 | 59389 | 13284 | 24842 | 81976 | 13968 | 67491 | 46198 | 81943 | 15283 | 65255 | 49913 | 17088 | 10405 | 14916 | 92804 | 62365 | 76765 | 79391 | 54682 | 68981 | 33524 | 18156 | 76148 | 23054 | 66461 | 77019 | 33406 | 94024 | 51127 | 34897 | 23852 | 13284 | 72435 | 81607 | 26294 | 77019 | 42775 | 13961 | 75922 | 97390 | 47133 | 87320 | 36766 | 95060 | 30569 | 95399 | 27931 | 19111 | 54334 | 29670 | 40819 | 18317 | 70620 | 90199 | 65626 | 93032 | 53032 | 31988 | 80476 | 13284 | 26777 | 11497 | 56970 | 23054 | 40175 | 89542 | 76426 | 77019 | 25173 | 94024 | 87181 | 95399 | 51275 | 77019 | 16447 | 63367 | 81943 | 50854 | 10254 | 78936 | 75282 | 45758 | 60082 | 23054 | 64998 | 79829 | 49070 | 13431 | 56755 | 52197 | 69071 | 73076 | 75338 | 17299 | 75541 | 29541 | 90443 | 88931 | 89908 | 84016 | 13663 | 62808 | 36653 | 13284 | 49672 | 67563 | 55603 | 11156 | 66603 | 64971 | 88089 | 13284 | 42518 | 72738 | 63672 | 65255 | 46069 | 92788 | 35113 | 47405 | 25531 | 68032 | 55846 | 41799 | 68911 | 99772 | 97864 | 43603 | 67936 | 13284 | 64842 | 97422 | 95511 | 77019 | 53067 | 70247 | 33019 | 65117 | 48961 | 89542 | 91310 | 82114 | 81303 | 13284 | 21127 | 46293 | 55847 | 81943 | 49862 | 95399 | 90703 | 91620 | 51583 | 59242 | 95384 | 44667 | 71879 | 10528 | 51111 | 51072 | 73704 | 64836 | 67917 | 43603 | 90318 | 65645 | 38668 | 46293 | 58760 | 48017 | 46625 | 81450 | 31014 | 94197 | 60854 | 97422 | 37481 | 81450 | 49181 | 89542 | 94558 | 82318 | 88224 | 74894 | 33578 | 38935 | 17470 | 47295 | 97321 | 73090 | 14158 | 29681 | 71896 | 90132 | 37567 | 30968 | 13543 | 84125 | 56076 | 69071 | 17520 | 97422 | 13731 | 83298 | 64073 | 13431 | 79501 | 48002 | 15814 | 81943 | 22828 | 54359 | 82055 | 70247 | 45012 | 81943 | 65118 | 34203 | 27935 | 71093 | 72534 | 90132 | 67283 | 90132 | 94197 | 96436 | 11632 | 43603 | 57374 | 23054 | 88992 | 75593 | 40356 | 22369 | 55831 | 13431 | 21812 | 65255 | 13044 | 46867 | 61280 | 28505 | 93877 | 81976 | 97018 | 47932 | 39895 | 66100 | 94335 | 13575 | 43867 | 43722 | 91800 | 13284 | 39295 | 59394 | 37827 | 91359 | 43381 | 46913 | 12882 | 10753 | 99546 | 14556 | 69726 | 83158 | 92017 | 45758 | 92576 | 85933 | 82806 | 99520 | 95240 | 16049 | 73226 | 75691 | 95399 | 75289 | 41658 | 13284 | 32251 | 72477 | 21150 | 81976 | 25532 | 89542 | 68624 | 43603 | 99988 | 47405 | 28545 | 73762 | 47911 | 14241 | 10006 | 45084 | 70869 | 97422 | 76635 | 17299 | 74980 | 16768 | 29665 | 32846 | 22260 | 13284 | 83589 | 16768 | 12297 | 43603 | 94460 | 30815 | 14367 | 74187 | 48459 | 78588 | 48094 | 14916 | 64554 | 34585 | 40966 | 15981 | 55992 | 68759 | 56286 | 64836 | 91359 | 58182 | 37712 | 46867 | 10002 | 27220 | 35390 | 51119 | 79851 | 27599 | 28003 | 29681 | 11126 | 81943 | 77889 | 56829 | 21290 | 65255 | 12281 | 42665 | 58526 | 23054 | 96441 | 43603 | 32713 | 24189 | 11803 | 69829 | 15808 | 15511 | 87150 | 87399 | 61028 | 69071 | 43603 | 18973 | 49827 | 13284 | 79374 | 17299 | 63980 | 46293 | 35321 | 91359 | 63092 | 77019 | 93950 | 81943 | 61348 | 98676 | 67412 | 26112 | 88625 | 61556 | 82756 | 46867 | 61980 | 51275 | 33183 | 15153 | 82717 | 54552 | 10272 | 69791 | 90197 | 85585 | 66042 | 81450 | 87499 | 55031 | 22891 | 59921 | 19636 | 87817 | 14035 | 89514 | 44978 | 72496 | 66453 | 83959 | 35532 | 21026 | 90326 | 76422 | 45538 | 14916 | 58391 | 45699 | 68240 | 23054 | 17327 | 17309 | 54811 | 36357 | 29411 | 13575 | 19772 | 20557 | 55843 | 19650 | 34136 | 23054 | 35640 | 80932 | 31022 | 13284 | 51453 | 17849 | 59415 | 73413 | 47405 | 60585 | 24554 | 59847 | 16449 | 77019 | 84635 | 13284 | 71150 | 79399 | 91304 | 45758 | 16316 | 45156 | 24372 | 65255 | 51800 | 56078 | 25967 | 56557 | 10335 | 13575 | 26500 | 61450 | 21511 | 65255 | 47266 | 52620 | 51507 | 36666 | 43522 | 16768 | 13302 | 60048 | 28720 | 13431 | 27828 | 60848 | 17916 | 65255 | 27845 | 63254 | 60848 | 90132 | 15202 | 26716 | 21780 | 50888 | 45198 | 50172 | 15593 | 56206 | 84399 | 81976 | 84383 | 97422 | 45107 | 50570 | 55693 | 45156 | 61697 | 77864 | 40967 | 99041 | 12361 | 81976 | 85195 | 10836 | 23903 | 59921 | 75889 | 63849 | 85462 | 69833 | 55277 | 98966 | 99467 | 16768 | 80545 | 92826 | 97028 | 13431 | 49543 | 58198 | 79679 | 81450 | 37768 | 14916 | 49987 | 43592 | 52388 | 81391 | 49705 | 31727 | 97337 | 89542 | 65261 | 15228 | 32193 | 23798 | 96980 | 56609 | 55973 | 96548 | 43554 | 54178 | 14385 | 53532 | 13284 | 52896 | 31417 | 79377 | 39843 | 40105 | 47537 | 60848 | 97596 | 94197 | 92481 | 23651 | 32979 | 91359 | 20137 | 44731 | 32782 | 77019 | 97715 | 14916 | 36171 | 73797 | 52352 | 77019 | 65624 | 70034 | 43735 | 94024 | 32065 | 81450 | 37801 | 70247 | 57260 | 91182 | 58699 | 22228 | 46293 | 95695 | 88201 | 51470 | 65421 | 70247 | 98471 | 80000 | 97663 | 91359 | 29825 | 40467 | 36280 | 83692 | 63395 | 93834 | 13431 | 46293 | 65598 | 56325 | 45294 | 58994 | 36392 | 13431 | 48817 | 70247 | 42632 | 14916 | 75814 | 12534 | 79015 | 29681 | 63583 | 14222 | 21811 | 65255 | 15712 | 77019 | 82774 | 94024 | 25558 | 87504 | 40351 | 82954 | 66201 | 41337 | 17467 | 13431 | 25618 | 78048 | 21325 | 93477 | 48070 | 23054 | 71739 | 44215 | 22764 | 14916 | 70342 | 81976 | 61768 | 43603 | 90132 | 31672 | 35753 | 85115 | 87424 | 95399 | 44506 | 59921 | 58439 | 69764 | 91737 | 43091 | 84038 | 85175 | 34169 | 32959 | 57299 | 67053 | 16078 | 55031 | 94423 | 45156 | 12025 | 76644 | 49243 | 35658 | 24206 | 76815 | 19466 | 68123 | 36271 | 16768 | 20805 | 59921 | 44320 | 90492 | 55138 | 64836 | 80603 | 45758 | 80337 | 30227 | 59921 | 67830 | 95013 | 23975 | 42358 | 45118 | 60271 | 62795 | 91829 | 14916 | 72118 | 81976 | 42079 | 64836 | 29714 | 47405 | 75024 | 69180 | 97698 | 17299 | 53871 | 60848 | 32772 | 94024 | 23136 | 69263 | 65014 | 13284 | 99723 | 70247 | 10739 | 69071 | 96656 | 20261 | 77088 | 64836 | 60997 | 27431 | 16566 | 59892 | 34855 | 71849 | 13575 | 43778 | 10925 | 81943 | 41426 | 38747 | 45792 | 91359 | 77266 | 13575 | 54453 | 89542 | 26345 | 88825 | 45204 | 69926 | 22055 | 70247 | 66184 | 45758 | 89954 | 13284 | 76966 | 78245 | 16756 | 75144 | 35954 | 13431 | 41534 | 55700 | 34625 | 25112 | 16484 | 27791 | 13180 | 43603 | 72476 | 26272 | 56865 | 44266 | 29214 | 52239 | 48021 | 13137 | 85762 | 56515 | 11530 | 14094 | 25191 | 46867 | 40256 | 27805 | 42575 | 35753 | 78015 | 89542 | 79395 | 36014 | 51976 | 60848 | 91540 | 78975 | 15438 | 29681 | 83498 | 13575 | 70566 | 28673 | 78791 | 46293 | 40988 | 46249 | 84968 | 15198 | 12950 | 51470 | 43049 | 40408 | 29441 | 17880 | 33283 | 29681 | 45021 | 77019 | 19403 | 60496 | 37671 | 13897 | 52800 | 46293 | 65255 | 73346 | 19007 | 78906 | 61032 | 95399 | 41062 | 99758 | 58160 | 16768 | 16220 | 49027 | 10787 | 64836 | 55534 | 70247 | 32708 | 17299 | 26862 | 17299 | 32335 | 46867 | 46693 | 23383 | 24824 | 75634 | 21313 | 80071 | 53841 | 35488 | 76356 | 81943 | 10703 | 43632 | 82980 | 98849 | 11274 | 88022 | 68390 | 65255 | 45798 | 90132 | 66426 | 37716 | 27073 | 81077 | 40291 | 57328 | 76494 | 71247 | 44324 | 90132 | 15572 | 62595 | 67578 | 19687 | 59765 | 81976 | 29681 | 81450 | 24923 | 60526 | 63193 | 28900 | 68670 | 81943 | 21643 | 55031 | 17767 | 98815 | 70739 | 17299 | 77675 | 64144 | 65919 | 70247 | 86115 | 35753 | 35921 | 70247 | 35695 | 95399 | 17571 | 90132 | 10776 | 23054 | 55618 | 19388 | 23004 | 60854 | 35209 | 81976 | 70656 | 48543 | 28799 | 13575 | 62772 | 16890 | 88333 | 35753 | 89689 | 12805 | 96145 | 16768 | 44732 | 79829 | 41319 | 70247 | 17299 | 81450 | 48321 | 81450 | 60541 | 32436 | 98932 | 47405 | 50849 | 27716 | 81857 | 62305 | 64010 | 89156 | 34841 | 99387 | 27063 | 83357 | 73447 | 64896 | 83334 | 29681 | 44937 | 87174 | 59004 | 13575 | 17881 | 49843 | 71379 | 50689 | 92853 | 47405 | 32440 | 91359 | 88509 | 13575 | 29889 | 42477 | 83016 | 14916 | 34898 | 19758 | 43489 | 89542 | 26612 | 13575 | 58720 | 93232 | 63399 | 16768 | 46867 | 29681 | 23466 | 17299 | 63419 | 70636 | 53408 | 34371 | 66651 | 75494 | 44058 | 18000 | 13953 | 81450 | 69061 | 13284 | 92526 | 15134 | 69474 | 97422 | 56975 | 26225 | 94591 | 26288 | 20141 | 33683 | 84695 | 17299 | 14687 | 79829 | 34338 | 64836 | 26755 | 89542 | 11290 | 21632 | 30499 | 83141 | 52953 | 16639 | 78106 | 31125 | 44897 | 79242 |


*** Split the raw input into two lists

From [[info:cl#Loop Basics][Emacs Lisp Manual cl#Loop Basics]]:

#+begin_quote
The ‘cl-loop’ macro essentially creates a mini-language within Lisp that
is specially tailored for describing loops.  While this language is a
little strange-looking by the standards of regular Lisp, it turns out to
be very easy to learn and well-suited to its purpose.
#+end_quote

Here's a way to create two separate lists by taking every other element from the raw input

#+begin_src elisp
(setq list1 (cl-loop for x in raw_input by 'cddr collect x)
      list2 (cl-loop for x in (cdr raw_input) by 'cddr collect x))
#+end_src


This uses:
- =by 'cddr= to skip every other element. It uses the builtin function =cddr=, and quotes ='= it, because it's a function, not a variable (different binding namespaces).
- First loop starts from beginning 
- Second loop starts from second element (using =cdr=)

**** Note about =car=, =cdr=, and =cddr=

Compare to Python:

#+begin_src python
head = my_list[0]
tail = my_list[1:]
shorter_tail = my_list[2:]
#+end_src

#+begin_src elisp
(setq
   head (car my_list)
   tail (cdr my_list)
   shorter_tail (cddr my_list))
#+end_src


*** Sort the lists


Here's how to sort the lists in ascending order:

#+begin_src elisp
(setq sorted1 (sort list1 '<)
      sorted2 (sort list2 '<))
#+end_src


The sort function in Emacs Lisp takes:
1. A list to sort
2. A predicate function (in this case '<' for ascending numeric sort)

This is similar to Python's:
#+begin_src python
sorted1 = sorted(list1)
sorted2 = sorted(list2)
#+end_src

Note: Emacs Lisp's sort modifies the original list. If you need to preserve the original, you should copy it first.



*** Compute the sum of the differences

Here's how to compute the sum of the absolute differences between corresponding elements:

#+begin_src elisp
(setq sum-of-diffs
      (cl-loop for x in sorted1
               for y in sorted2
               sum (abs (- x y))))
#+end_src

This uses cl-loop with:
- Two parallel iterators (=for x= and =for y=)
- =sum= accumulator that adds up each iteration's value
- =abs= to get absolute value
- =-= for subtraction

The equivalent Python would be:
#+begin_src python
sum_of_diffs = sum(abs(x - y) for x, y in zip(sorted1, sorted2))
#+end_src


** Part 2

#+begin_src elisp
;; For each number in list1, count how many times it appears in list2
;; Then multiply and sum
(setq similarity-score
      (cl-loop for x in list1
               sum (* x (cl-count x list2))))
#+end_src

The Python equivalent would be:
#+begin_src python
similarity_score = sum(x * list2.count(x) for x in list1)
#+end_src


** Full code

#+begin_src  elisp
(setq list1 (cl-loop for x in raw_input by 'cddr collect x)
      list2 (cl-loop for x in (cdr raw_input) by 'cddr collect x))

(setq sorted1 (sort list1 '<)
      sorted2 (sort list2 '<))

(setq sum-of-diffs
      (cl-loop for x in sorted1
               for y in sorted2
               sum (abs (- x y))))

(setq similarity-score
      (cl-loop for x in list1
               sum (* x (cl-count x list2))))

(list sum-of-diffs similarity-score)
#+end_src

* Day 2

** Part 1

*** Long Input Code
:PROPERTIES:
:VISIBILITY: folded
:END:

#+begin_src elisp :results none
(setq raw_input2 '(
(1 4 5 8 11 12 9)
(7 8 9 10 12 15 17 17)
(17 20 23 25 27 31)
(55 57 58 61 63 64 70)
(39 42 45 43 44)
(84 85 86 87 90 89 86)
(33 34 35 36 35 37 38 38)
(8 9 11 8 10 11 13 17)
(34 35 37 39 38 40 45)
(47 50 50 51 53 54)
(54 55 58 58 59 56)
(95 98 99 99 99)
(53 54 54 57 61)
(65 68 71 71 73 78)
(19 20 23 27 28 30 33 36)
(78 79 81 85 83)
(24 25 27 29 30 32 36 36)
(78 79 80 83 86 90 93 97)
(30 31 35 38 40 42 49)
(61 63 66 71 74 75)
(77 80 82 83 89 87)
(58 61 68 70 71 74 75 75)
(20 23 24 25 28 35 36 40)
(25 28 35 36 38 40 46)
(47 46 49 52 55)
(78 76 78 79 81 78)
(14 13 15 17 19 21 21)
(77 74 77 79 80 84)
(91 89 91 93 94 99)
(65 64 63 65 66 67 70)
(49 48 51 53 56 54 52)
(29 28 30 33 31 34 34)
(70 69 71 70 74)
(41 38 39 41 43 41 46)
(88 85 88 90 90 92)
(37 34 36 37 37 39 42 40)
(57 55 58 61 61 61)
(46 44 46 46 50)
(78 75 77 78 79 79 82 89)
(86 83 86 87 91 92 95)
(17 14 16 17 21 18)
(34 32 36 39 39)
(60 59 62 66 68 70 73 77)
(59 58 60 61 63 65 69 75)
(41 40 42 45 46 49 55 58)
(4 3 4 5 8 15 16 14)
(5 4 10 11 11)
(15 14 17 24 26 30)
(59 56 59 60 67 69 70 77)
(38 38 39 41 43)
(78 78 81 84 85 88 85)
(24 24 25 27 29 30 31 31)
(51 51 54 55 56 58 61 65)
(30 30 32 35 40)
(84 84 85 82 83)
(45 45 48 49 46 43)
(60 60 59 60 61 62 62)
(35 35 36 33 36 39 43)
(47 47 44 45 52)
(85 85 86 86 88 91 94)
(55 55 55 57 56)
(24 24 24 27 29 31 32 32)
(47 47 50 52 52 54 55 59)
(41 41 41 43 49)
(7 7 10 12 16 19 20 23)
(28 28 30 34 37 38 40 39)
(72 72 74 77 80 84 86 86)
(25 25 27 29 32 36 39 43)
(15 15 18 22 28)
(79 79 82 89 92 93)
(55 55 60 61 59)
(23 23 24 31 33 33)
(58 58 64 65 69)
(76 76 83 84 87 89 92 97)
(50 54 55 57 59)
(23 27 28 30 31 32 33 31)
(8 12 14 17 20 20)
(31 35 37 40 42 43 46 50)
(51 55 57 58 63)
(37 41 44 47 45 46)
(23 27 28 31 29 32 29)
(68 72 75 72 72)
(39 43 45 47 44 45 47 51)
(20 24 21 24 30)
(74 78 79 80 80 81 82 83)
(58 62 64 64 67 68 69 67)
(17 21 23 23 26 26)
(21 25 27 29 30 30 34)
(86 90 92 92 98)
(23 27 29 30 33 37 39 40)
(33 37 38 42 44 43)
(29 33 36 37 40 44 44)
(21 25 27 28 32 35 39)
(56 60 62 66 67 73)
(69 73 80 82 83 85 87)
(22 26 31 34 35 38 41 39)
(40 44 50 52 52)
(45 49 54 57 58 60 64)
(41 45 46 49 51 58 63)
(46 53 55 56 59 62)
(10 16 18 20 21 22 21)
(19 24 26 29 29)
(28 34 36 39 42 44 48)
(10 17 20 21 23 26 32)
(79 86 88 87 88)
(8 13 14 15 13 16 13)
(18 25 26 28 31 32 29 29)
(19 24 21 22 26)
(41 48 50 47 53)
(58 65 68 68 69 72 74 75)
(84 90 90 93 95 93)
(63 68 68 69 69)
(77 84 84 86 89 93)
(9 14 16 16 17 20 27)
(17 22 25 29 32 35 37 40)
(76 83 87 89 86)
(30 37 39 41 42 46 46)
(76 83 84 85 89 91 95)
(76 82 86 87 88 89 96)
(68 75 80 81 83 85 88)
(1 7 10 11 16 15)
(82 87 90 96 96)
(70 75 77 82 85 89)
(18 25 27 30 33 39 41 46)
(23 20 18 17 14 11 8 9)
(98 96 95 92 91 90 90)
(78 77 76 74 73 69)
(52 51 50 47 44 42 39 33)
(82 80 82 79 78 77 74)
(41 38 39 37 40)
(35 32 34 32 32)
(81 78 75 72 73 71 68 64)
(64 63 62 61 60 61 55)
(19 17 16 13 13 10)
(23 22 20 20 21)
(52 50 49 48 45 45 44 44)
(19 16 15 12 10 10 6)
(25 24 24 23 22 20 13)
(95 92 91 89 87 86 82 79)
(54 51 49 46 42 44)
(73 71 69 67 63 61 61)
(82 80 77 73 72 70 66)
(23 20 17 13 12 11 6)
(33 30 29 22 21)
(18 16 9 8 6 5 7)
(89 86 85 80 80)
(54 52 47 46 45 41)
(73 71 70 68 66 65 59 53)
(57 58 57 54 51)
(88 89 86 84 82 79 76 78)
(42 45 42 41 39 38 38)
(74 77 76 74 70)
(21 23 22 19 14)
(15 18 17 20 18 17 16 13)
(49 50 52 51 48 50)
(21 23 20 22 19 16 16)
(61 62 60 61 59 58 54)
(94 97 94 93 94 88)
(91 94 94 91 90)
(43 46 45 45 47)
(33 35 35 33 33)
(63 65 62 60 60 56)
(27 29 28 27 25 22 22 16)
(80 83 79 77 75 72)
(66 68 67 63 62 61 64)
(31 33 32 28 28)
(73 76 72 71 68 65 61)
(62 65 64 63 59 57 51)
(24 26 23 22 21 19 12 11)
(23 24 19 18 15 14 16)
(87 90 84 81 78 77 77)
(80 82 80 74 70)
(37 39 36 30 24)
(66 66 64 61 60 59)
(9 9 8 7 4 2 5)
(30 30 28 27 25 25)
(59 59 56 54 52 48)
(27 27 25 23 20 17 10)
(41 41 44 42 41 38 37)
(92 92 91 94 92 94)
(53 53 52 51 50 52 51 51)
(29 29 30 29 26 22)
(48 48 47 44 41 44 37)
(60 60 57 57 54)
(25 25 22 19 19 16 19)
(39 39 38 35 32 32 30 30)
(92 92 90 90 88 86 82)
(86 86 86 84 81 80 79 72)
(95 95 92 89 85 84 81 80)
(30 30 27 23 20 18 15 16)
(96 96 94 91 88 85 81 81)
(77 77 75 74 70 68 66 62)
(46 46 43 42 41 37 30)
(67 67 60 57 55 54 52 51)
(35 35 33 26 27)
(79 79 76 74 68 66 65 65)
(67 67 66 59 55)
(51 51 48 43 40 33)
(32 28 27 25 24)
(39 35 32 31 30 29 31)
(49 45 43 40 39 39)
(45 41 39 37 36 32)
(46 42 41 38 37 34 31 24)
(85 81 82 81 80)
(20 16 18 17 15 14 12 15)
(71 67 65 62 65 62 60 60)
(87 83 84 81 77)
(9 5 8 7 6 1)
(54 50 49 49 47 46 44)
(98 94 93 93 92 91 94)
(94 90 87 85 85 83 83)
(79 75 75 72 68)
(88 84 81 80 80 75)
(43 39 35 32 31 29)
(40 36 32 29 28 25 22 25)
(62 58 57 53 53)
(71 67 66 63 61 57 55 51)
(53 49 45 42 37)
(36 32 29 26 24 21 14 13)
(96 92 89 86 84 79 78 79)
(45 41 39 37 31 28 28)
(93 89 84 81 79 76 74 70)
(60 56 55 52 47 44 41 36)
(55 48 45 43 41 39 36)
(39 32 31 29 28 30)
(80 73 71 69 67 65 63 63)
(22 17 16 15 12 10 6)
(92 86 84 81 79 76 74 69)
(29 23 22 21 19 21 19)
(70 64 61 58 61 60 58 61)
(33 26 23 20 22 20 17 17)
(57 50 53 50 48 45 44 40)
(61 56 59 57 51)
(30 25 23 23 22)
(59 53 53 51 48 51)
(19 13 10 9 7 7 7)
(53 46 45 42 39 39 35)
(17 11 11 9 6 1)
(73 67 65 64 60 57 56 53)
(69 63 59 57 58)
(34 27 25 22 21 17 17)
(53 47 43 41 40 36)
(51 45 44 42 41 37 34 29)
(60 55 52 51 48 46 40 39)
(21 15 12 10 5 8)
(26 19 13 12 11 9 7 7)
(63 56 54 49 45)
(38 31 25 23 21 19 13)
(70 63 63 61 60 57 54 56)
(68 64 63 62 59 59 57)
(98 94 91 91 88 85 83 79)
(49 51 53 54 57 62 65 71)
(53 57 63 64 67 71)
(30 34 35 39 42 43 43)
(69 76 79 79 82 83 87)
(66 66 63 60 60 59 55)
(21 28 31 34 33 34)
(85 84 83 80 79 79 79)
(62 62 62 59 56)
(91 90 87 82 79 79)
(61 60 59 55 52)
(71 69 70 72 74 76 79 76)
(95 93 92 88 85 84 83 83)
(86 82 80 77 76 69)
(25 29 31 33 34 34 35 39)
(23 23 24 21 20 19 15)
(71 75 75 78 79)
(88 86 89 89 92)
(35 35 37 40 38 38)
(59 59 58 54 52 48)
(43 38 35 32 30 24 22 21)
(64 69 69 72 74)
(67 68 67 64 63 59 62)
(71 71 65 63 60 56)
(53 56 57 55 57 59 60 58)
(75 78 75 72 74 71 68 68)
(80 79 82 85 82 86)
(79 73 73 72 72)
(70 70 69 63 61 54)
(31 37 44 46 47 49 52 51)
(70 69 70 73 72 69)
(31 31 28 31 30 27 25 18)
(28 22 20 19 16 12)
(60 55 52 52 49 47 46 42)
(39 35 32 32 31 28 31)
(16 20 21 25 24)
(8 7 8 10 11 10 11)
(78 81 84 87 87 88)
(82 83 80 78 74)
(2 7 9 12 13 17 19 18)
(45 47 50 53 56 59 59)
(21 21 23 21 23)
(14 16 11 10 5)
(86 89 88 87 86 84 82 82)
(50 46 45 38 34)
(16 19 21 23 20 22)
(57 57 60 63 66 66 65)
(75 74 75 79 83)
(86 83 84 82 79 78 80)
(65 65 62 61 63 61 59 59)
(73 76 80 81 83 85 89)
(99 92 93 91 90 83)
(41 45 48 51 54 55 61)
(85 79 72 71 69 70)
(20 17 18 20 23 30 31 31)
(62 63 64 66 66 70)
(70 73 77 78 85)
(66 65 68 70 76 78 82)
(35 39 41 44 41 42 44)
(12 19 22 25 28 30 32 37)
(80 77 76 75 73 72 65)
(93 86 80 79 75)
(58 54 48 46 43 41)
(29 27 30 33 30 31 34 41)
(31 32 33 35 37 37 36)
(34 35 33 27 26 25 24)
(81 83 85 86 88 90 92 90)
(47 46 44 40 38 41)
(37 37 37 36 33 26)
(85 85 79 78 75 74 72 73)
(30 30 27 21 21)
(42 42 40 36 36)
(21 21 23 27 30)
(69 75 76 78 78 78)
(89 87 85 82 82)
(58 54 52 53 52 49 46 48)
(98 96 95 93 96 92)
(45 44 42 40 33 28)
(8 8 11 10 9 11)
(82 77 76 73 66 63 58)
(33 35 35 32 29 28 26 27)
(50 47 45 45 43 40 38 34)
(66 68 65 62 65 67)
(13 8 6 5 1 2)
(10 10 13 16 18 20 22 22)
(76 77 80 82 80 80)
(28 24 21 24 22 16)
(68 64 61 60 59 56 53 55)
(26 27 26 27 30 33 35 40)
(61 67 67 68 71 78)
(34 41 42 45 48 52 54 54)
(71 74 75 73 74 78)
(62 62 61 60 57)
(41 35 33 30 29 27 25 19)
(41 42 45 46 47 51 48)
(25 25 28 31 33 31 35)
(58 62 68 71 74 76 79 82)
(67 73 76 80 82 84 86)
(40 40 37 36 38 36)
(88 84 81 76 73 70 70)
(35 31 30 29 25)
(42 35 32 28 23)
(24 28 25 28 31 29)
(25 29 32 36 41)
(5 10 13 15 20 24)
(9 9 11 12 13 15 18 15)
(50 46 43 41 40 36 34)
(40 38 38 39 40 44)
(24 24 27 28 30 34 36 40)
(46 48 50 47 45 42 37)
(99 95 92 90 91 89 85)
(3 9 10 12 14 18)
(39 33 31 32 33)
(73 70 72 76 77 80 80)
(18 16 19 22 24 30)
(27 27 24 22 19 16 12 5)
(29 22 19 16 13 10 4 4)
(14 16 13 9 4)
(68 64 62 61 59 57 55 52)
(22 26 28 29 29)
(70 74 74 75 77 80 80)
(85 85 82 80 79 77 75 75)
(32 36 39 38 40 43 48)
(54 55 55 57 60 62 62)
(68 68 71 71 74 76)
(24 28 31 32 33)
(85 82 83 85 88 90 94)
(80 82 87 89 90 89)
(64 61 59 57 52 51 47)
(64 70 73 75 72)
(40 44 46 51 50)
(48 53 56 58 55 56 56)
(94 92 89 88 85 87 81)
(24 19 16 13 12 9 7 7)
(1 2 4 4 9)
(94 93 92 95 93 91 89)
(74 68 68 65 62 59 52)
(4 7 5 7 5)
(27 23 20 16 16)
(56 54 56 59 59)
(65 65 65 67 68 70 72 72)
(66 68 73 74 74)
(62 62 64 66 68)
(65 69 66 69 71 72 72)
(83 90 89 90 94)
(56 56 57 57 59 61 68)
(93 90 86 85 82 77)
(34 30 30 29 26 26)
(34 39 43 45 47 54)
(12 13 12 10 7 1)
(59 63 65 64 68)
(14 14 16 17 21)
(6 3 4 11 12 19)
(76 74 71 70 67 67 66 68)
(50 56 58 60 63 67 71)
(55 49 46 45 44 43 42 44)
(78 73 70 68 65 63 59 56)
(89 86 89 89 91 93 91)
(65 66 68 69 76 79 81 82)
(22 21 18 17 16 14 7 4)
(20 20 23 24 29 31 31)
(45 50 53 59 61 62 64 71)
(61 61 60 57 54 53 55)
(73 69 66 64 63 60 60)
(60 60 57 56 55 55 57)
(78 76 76 79 80 83 90)
(4 4 5 7 13)
(73 73 73 71 69 69)
(50 45 44 40 37 33)
(3 4 7 10 13 16 19 23)
(86 83 79 76 72)
(85 84 85 87 90 97 99)
(17 16 19 22 23 27 28)
(87 81 78 81 78 76 75 72)
(22 26 28 30 32 36)
(38 33 30 29 27)
(54 56 53 51 47 44 41 38)
(43 43 44 47 48 52 59)
(95 92 93 94 95 97)
(46 46 49 53 54 57 59 57)
(34 36 36 34 34)
(39 36 34 34 33)
(62 58 56 55 57 57)
(80 83 81 81 79 77 72)
(34 38 44 47 48 50 53 59)
(24 19 17 15 15 13)
(13 17 18 22 23)
(10 8 9 12 16 18 17)
(22 18 17 17 10)
(75 80 79 80 83 84 86 84)
(59 55 54 53 49 45)
(34 39 45 46 46)
(26 22 21 20 13 10 8 9)
(16 15 13 11 10 9 10)
(11 13 10 6 4 4)
(59 61 59 56 53 49 45)
(57 59 58 51 48 48)
(33 29 27 26 22 17)
(85 87 86 80 81)
(56 56 59 65 67 70 69)
(86 84 87 93 96 98 96)
(54 57 60 62 65)
(52 54 55 58 59 61 63)
(73 72 71 68 67)
(45 47 50 51 53 54 56)
(24 23 22 20 19)
(73 70 69 68 66 64)
(30 32 33 35 37 39 40)
(7 9 10 13 14 17 18 20)
(67 66 64 61 59)
(31 28 26 25 24 22 20 18)
(20 17 14 13 11)
(18 21 23 26 29 32 35)
(53 54 57 60 62)
(68 71 72 74 77 78 81 84)
(22 24 25 26 29 31 34)
(15 18 20 21 24 26 29 32)
(41 39 38 35 34 31)
(63 65 68 70 72 74 75 76)
(97 94 92 89 86 84 81 80)
(71 72 74 77 80 81)
(54 51 49 48 47 45 42)
(68 67 66 65 62)
(24 26 29 30 31 32 34)
(25 26 29 32 35 36 37)
(88 86 83 80 77 76 75 74)
(62 60 57 54 52 50 49)
(64 62 59 58 56)
(54 55 57 60 63 66)
(28 30 31 32 34)
(63 62 60 57 56 54 51 49)
(83 85 86 88 89 91 92)
(1 4 5 7 10 13 15)
(32 31 30 28 26 24 23 20)
(84 86 88 90 92 94 95)
(24 23 21 20 19 18)
(92 91 88 85 84)
(23 26 27 28 31 32 33 36)
(36 38 39 40 43 45 47 49)
(29 26 24 21 20 17)
(12 10 9 7 4 3 2)
(25 23 21 19 17 15 13 12)
(38 37 35 32 31)
(11 12 15 18 19)
(99 96 95 93 90)
(39 37 36 33 30)
(35 37 39 40 43)
(79 76 74 73 70 68)
(40 37 34 33 30 28)
(71 70 68 67 65 64 63 62)
(95 92 91 89 86 83)
(45 44 43 40 39 36)
(29 26 25 23 22 21)
(67 68 71 73 75 78 79 82)
(95 92 89 88 86 85)
(6 7 10 11 12 14)
(46 45 43 41 38 36)
(31 29 27 26 25 22)
(47 50 53 55 57)
(70 71 73 76 77)
(13 16 17 19 22 25 26 28)
(40 42 43 44 47 50 51 52)
(40 41 42 45 47 50)
(70 71 74 76 78)
(65 68 71 73 76)
(23 26 29 30 33)
(48 51 53 56 57 58)
(69 70 73 74 77 78 80 81)
(28 30 32 35 36)
(67 68 69 71 73 76)
(93 90 87 85 82 80)
(67 65 64 62 60)
(38 35 33 31 30 27 24 23)
(98 96 94 92 89 86)
(14 11 9 8 7 4)
(71 72 73 76 77 79 82 83)
(80 79 78 75 73 72 69)
(10 8 6 5 3)
(85 84 82 79 76 74 73 72)
(60 57 56 55 54)
(67 66 64 61 58 57 55)
(56 59 62 63 65 66 69 70)
(49 52 55 56 57 58 59 61)
(98 96 94 92 89 86 83 81)
(62 64 65 68 69)
(33 35 36 37 38 41 43)
(76 79 81 84 86)
(22 23 26 29 32 34 36)
(38 36 33 31 28)
(77 75 74 73 72 69 67)
(49 52 55 56 57 60 62)
(92 91 88 86 85 83 80)
(60 58 57 56 53 51 48)
(34 37 40 43 44 47 49)
(19 18 17 15 12 11)
(86 83 81 79 76 75)
(63 61 60 59 56)
(62 63 66 68 70 73 74 77)
(53 56 58 60 63 64 65 67)
(4 6 8 9 10)
(73 76 78 80 81)
(66 64 61 59 58 57 54)
(82 80 79 77 75)
(14 15 18 21 23)
(10 11 14 17 19)
(32 34 37 40 43)
(67 68 71 74 76 78)
(85 83 80 79 77 76 73)
(24 21 19 17 15 14 11)
(24 23 20 17 15 13 11)
(55 58 59 60 63 65 66 68)
(37 36 33 30 28)
(56 53 52 49 47 46 43)
(76 73 71 69 67 64 63)
(86 83 82 81 79 76 74)
(74 75 77 80 82 83 85 87)
(65 68 70 71 72 75 77)
(51 48 45 42 39)
(45 43 41 39 37 34)
(14 16 19 21 23 25)
(39 41 44 45 48 50 53)
(51 50 49 46 45 43 42 39)
(34 31 28 26 25 23 22)
(55 57 60 62 64 66 67)
(66 64 63 61 59 56 53)
(33 35 38 41 42 44 46)
(38 36 33 32 31 30 27)
(26 27 30 31 32 35)
(24 25 26 29 32 33)
(65 64 63 61 58)
(22 25 27 30 32 35 37 38)
(33 32 30 27 25)
(71 74 75 76 77)
(82 81 80 79 78 76 75 74)
(49 48 46 44 43 41 39)
(41 42 44 46 47)
(81 83 86 89 92 93)
(12 14 16 18 20 23)
(89 86 84 82 79 76 75)
(75 76 77 78 79 81)
(79 77 74 73 70 68 65 62)
(12 14 17 18 19 20)
(6 7 9 10 13 16 19 22)
(66 65 64 62 61)
(61 60 57 56 54 51 48 47)
(69 67 65 63 62 60 58)
(23 21 19 18 17)
(20 23 25 27 28)
(29 28 27 24 23 21 18)
(68 66 65 64 63 61)
(64 61 58 55 52 50 47)
(70 67 64 61 60 57)
(37 35 32 31 28 27 25)
(59 60 62 65 68 69 72 75)
(46 44 43 42 41 38 35)
(19 21 24 26 27 28 31)
(27 28 29 31 34 36 37 39)
(80 78 75 73 70 69 68 65)
(36 33 31 29 28)
(88 85 82 79 77 74)
(9 12 15 18 19)
(16 14 11 10 8 5 4 3)
(97 95 94 92 91 89)
(47 48 50 52 54 55 58 61)
(44 47 48 49 50 51)
(50 51 53 56 58)
(53 54 55 57 60 63 66)
(18 21 22 23 25 27)
(93 90 87 84 82 80 79)
(60 63 64 66 69 72 75 77)
(94 92 90 87 85 84 81)
(37 39 42 45 48)
(63 66 69 70 71 72)
(46 47 50 52 54 57 60)
(2 4 7 10 12)
(41 38 37 34 33 31)
(18 21 23 25 28 31)
(16 15 14 12 11 10 7 5)
(30 32 34 37 40 42 45 46)
(1 3 4 6 9 10)
(87 84 83 81 80 77)
(49 51 54 55 57 58 60 62)
(19 18 16 14 11 9)
(1 2 3 4 5 8)
(68 70 72 73 74)
(35 32 31 29 26 23 22 20)
(51 53 56 59 62 63 65 67)
(79 81 84 85 87 90 93)
(51 54 55 56 57 58)
(21 23 24 25 28 29)
(35 34 31 29 28 27 26)
(30 27 25 23 20 17 16 14)
(30 28 26 24 22 21 20 17)
(18 21 22 25 28 31 32 34)
(81 78 77 75 74)
(72 75 78 81 83)
(84 85 88 89 92 94 95 96)
(15 17 18 20 21 23)
(80 78 76 74 73 70 68 65)
(54 51 50 48 46 45)
(85 84 83 80 79 78 77)
(34 31 30 28 26 23)
(69 72 75 76 77 78 81)
(52 54 55 57 59)
(82 79 76 73 71 68 65 62)
(72 74 75 76 79 80)
(12 9 7 6 4 3 2 1)
(50 51 52 53 55 58 59 60)
(20 22 25 28 29)
(67 70 73 75 76)
(22 25 26 29 30)
(48 50 53 56 57 59 62 63)
(70 71 72 75 77 80 82)
(87 84 81 79 77)
(93 92 90 89 87)
(69 70 71 73 74 77)
(11 14 17 19 21 24 25 28)
(85 88 89 92 94)
(61 64 65 68 69 71 72)
(6 7 9 12 14)
(49 52 53 54 57 58 59)
(57 54 51 49 48 47 45)
(66 63 61 58 57 54 53 52)
(25 24 22 19 16 15 12 11)
(43 41 40 37 34 33 32)
(93 91 88 86 84 82 81 78)
(40 43 46 47 49 50)
(56 53 51 48 47)
(42 45 48 50 52 55)
(62 60 57 54 52 51)
(51 48 45 44 43 42 40)
(28 26 23 22 19 16 13 11)
(67 64 62 61 58 57)
(80 83 84 87 88 89)
(51 52 55 57 60 63 66)
(13 10 7 5 3)
(68 71 73 76 79 81 82)
(91 89 86 85 82 81 80)
(31 29 28 27 24 22 21)
(21 18 17 14 11 10 9 8)
(72 75 78 80 83 85)
(55 57 58 61 63 66 69)
(50 48 47 46 45)
(76 79 82 85 87 88)
(49 48 46 44 42 40 39 38)
(68 69 71 74 76)
(22 21 19 16 13)
(27 24 23 22 19 18)
(19 18 16 14 13 12 11)
(79 81 84 86 89)
(4 6 7 8 9 10)
(20 23 26 28 29 30)
(84 87 88 90 92)
(31 33 34 37 39 41 43)
(31 28 27 25 23 20)
(49 52 55 58 60 62 65)
(75 77 78 81 83 84 85 86)
(56 53 51 50 47 44 42 39)
(26 29 30 33 35 36 37 40)
(63 66 67 69 72 73 74)
(6 7 10 11 13 14 16)
(67 66 63 62 61 60 59 58)
(60 61 63 64 66 68 70)
(19 17 16 15 13 12 9 6)
(88 85 82 79 77 76 74)
(15 14 12 11 9)
(3 4 5 8 10 12)
(14 12 9 7 6 4)
(40 37 36 34 33 31)
(28 31 34 36 37 39 40)
(30 32 33 35 36 37)
(62 60 58 57 55 54 51)
(60 58 55 52 50)
(57 58 61 63 66 69 70 72)
(81 80 77 76 75 73)
(72 70 69 66 64 62 59)
(84 81 78 77 75 74 73)
(79 82 84 87 89 92)
(84 87 88 90 92 94)
(28 25 23 22 21)
(57 56 53 52 51 50 48)
(25 27 29 31 32 35 36)
(20 22 25 27 28 31)
(41 40 37 34 32 30 28)
(52 55 58 59 60 62 65)
(57 55 54 52 50 48 45)
(81 78 75 74 71)
(73 76 78 80 82)
(26 25 22 20 19 16 15 13)
(68 67 65 62 60 58 56)
(43 41 39 37 35)
(70 73 74 77 79 80)
(88 85 83 80 77 74 72)
(82 79 76 73 70)
(56 53 52 49 46 43 40)
(45 42 40 39 38 35 32)
(21 23 24 27 30 31 32 35)
(28 30 31 32 33 34 35 37)
(66 69 71 73 74 75)
(56 57 60 61 64)
(81 79 77 76 73 71)
(81 79 78 75 72 70)
(55 56 57 59 62 65 67)
(55 52 50 48 45)
(9 7 4 3 2 1)
(27 28 31 33 35 36)
(89 88 86 85 83 82 81 78)
(4 7 10 11 12 14 16 19)
(49 51 53 56 57 59 62)
(30 29 26 23 21 18 16 15)
(67 66 64 61 60)
(62 61 59 56 55)
(57 59 62 64 67)
(71 72 75 77 78 79 81)
(45 47 50 52 54 56)
(21 23 26 28 30 33 36 38)
(54 55 58 61 63 65 67 70)
(50 49 48 47 45 43)
(70 71 72 73 75 77)
(22 24 27 30 32 33 36 37)
(83 86 89 91 93 94 97)
(32 31 29 27 24)
(68 69 72 75 78 80)
(64 65 66 67 70 73)
(37 35 32 29 26)
(39 37 34 33 30 27)
(15 16 17 18 20)
(75 73 72 70 69 68 65 63)
(45 47 48 51 54 56)
(29 28 27 25 22 19 18 15)
(4 7 8 9 12 13 16 17)
(62 65 66 69 70 72)
(26 24 21 18 15 13 10 7)
(2 5 6 9 12 13)
(70 69 67 66 65 62)
(37 40 42 45 48)
(92 90 89 88 86 83 80 79)
(72 70 69 66 63)
(35 33 31 30 29 28)
(56 58 60 61 63 65)
(58 56 55 52 50)
(35 32 29 28 27 24 21)
(99 96 95 92 89)
(15 16 19 21 22 23 25)
(1 3 4 7 10 13 14 17)
(89 88 87 85 84 82 81 78)
(29 30 32 33 36 37)
(73 75 78 79 80 82 84)
(67 69 72 75 77)
(45 42 41 38 37 35 34)
(40 43 46 48 49)
(54 56 58 59 60 63 64 66)
(24 26 29 32 33)
(95 93 90 87 84)
(71 68 65 63 62 61)
(53 51 50 48 47)
(32 30 28 27 24 23)
(46 49 52 53 55 57 58)
(54 57 60 62 63 65 67)
(12 13 14 17 20 22 25 28)
(36 38 40 42 45 46 48)
(84 85 86 87 89)
(64 62 59 57 56 53 50 48)
(54 57 59 62 65 66 69 70)
(82 81 80 79 77 75)
(21 22 24 26 27 30 33)
(52 49 46 45 44 41)
(47 49 51 52 54 56 59 60)
(67 68 70 71 73 75)
(13 15 17 19 21 22 23)
(25 27 28 31 34 36 38 39)
(23 20 17 16 13 10 9 8)
(78 80 82 85 86 89 91 94)
(82 85 87 89 90 93 94)
(51 48 47 44 41 38 35)
(17 20 23 25 27)
(19 22 23 25 28 31 34)
(76 74 73 71 68)
(49 52 53 55 57 58 59 61)
(52 54 56 59 62)
(73 70 68 66 64 62 61 60)
(92 89 88 87 85)
(21 24 27 28 29)
(23 20 19 16 14)
(44 45 48 51 52)
(44 41 39 38 35)
(42 41 38 35 32 31)
(17 18 19 20 21 23)
(27 30 32 34 36 38 41 44)
(9 11 12 13 16 17)
(16 13 10 8 5 4 2)
(52 53 56 58 59 60 61)
(29 32 34 36 39 41 44)
(77 78 81 84 87)
(61 59 56 53 51 49 48 45)
(52 53 55 56 58 60 63)
(24 25 28 31 32 35 38 40)
(20 22 25 27 30)
(65 67 68 71 74 75)
(45 48 50 51 53 54 56)
(70 69 66 64 63 62)
(30 29 27 26 24 22)
(53 55 58 59 61 62)
(31 29 27 26 24 22 20 18)
(2 4 7 9 12 13)
(39 38 37 35 34 31 29)
(60 58 56 53 51 49 48)
(4 7 8 10 12 14)
(40 38 35 32 29 28 26 24)
(90 88 86 83 82 79)
(56 57 58 61 64 66 69 72)
(80 82 83 85 87 89 90)
(39 38 36 33 30 29)
(33 30 29 27 24 22 21 18)
(54 57 58 59 60 62)
(81 84 86 87 90 92 93 96)
(22 23 26 28 31)
(70 68 67 66 63)
(29 27 25 23 22 20)
(25 27 28 31 32 35 38 39)
(77 76 73 70 68 67)
(61 59 58 57 56)
(40 41 43 46 48)
(31 28 26 23 22 21 20 17)
(45 43 41 38 35)
(46 48 49 51 54 55)
(50 52 53 54 55 58 61 64)
(16 13 11 10 9 7 4 1)
(34 37 38 40 42)
(97 95 94 93 90 89 88 87)
(30 32 34 36 38 39 41 43)
(73 70 67 66 64 63 62)
(82 80 79 76 73 72)
(53 50 47 45 44 41 40 39)
(81 83 86 88 91 93 94)
(24 22 20 17 16 15)
(55 56 58 59 60 63 65 67)
(9 12 14 17 18 19 22)
(19 16 15 13 10 7 5)
(97 95 94 92 91 89 88 87)
(78 80 82 83 85 86 88 90)
(45 48 51 52 53 54)
(54 53 52 50 48 47 46 45)
(55 54 53 52 50)
(38 35 34 33 30 27 26)
(65 62 61 59 58 55)
(33 35 36 38 41 42 43 45)
(35 32 29 28 27 26 23)
(39 37 35 32 31 28 26 24)
(2 3 4 6 7 10 12 15)
(17 19 22 23 25 28)
(53 55 58 60 63 65 68)
(64 67 70 72 75)
(78 75 72 70 68 67)
(56 54 51 50 47 44)
(21 18 15 12 11 9)
(56 54 51 49 48 45 42 39)
(50 47 44 42 41 39 37)
(72 75 77 78 81 83 84)
(85 84 83 82 79 76)
(83 81 78 75 72)
(80 82 84 87 90 93 95)
(81 83 84 87 89 90)
(68 71 72 74 77 78 79)
(70 71 72 75 78 81 83 84)
(20 19 16 15 13)
(12 9 8 7 6 5 2)
(22 23 25 26 28 29 31 32)
(32 30 28 25 22 20)
(35 32 31 28 25 23)
(36 39 40 41 44 46 48 50)
(52 55 56 59 62)
(50 48 45 43 40 39 37 36)
(36 35 33 32 31 28)
(50 48 47 44 43 41 38 36)
(6 5 4 2 1)
(19 16 14 12 9 7 4)
(28 30 32 33 35)
(75 73 70 68 65)
(25 23 20 18 17 14 12)
(67 70 72 73 76 77 78)
(73 75 76 79 82 83)
(37 35 34 31 29)
(99 97 95 93 91 89)
(8 9 10 11 12 15)
(60 59 56 55 52 49 48 47)
(54 53 51 50 48 47)
(32 35 37 39 40 42)
(79 78 77 76 75)
(43 42 40 37 34 31)
(22 23 25 28 31)
(98 96 93 92 89 88 85)
(60 59 56 54 52 50 48 47)
(71 72 73 74 77 78 81)
(37 34 32 30 28 27)
(18 21 22 23 24)
(29 31 33 35 36 39 42 44)
(36 33 30 29 26 23 21 18)
(44 46 47 49 50 53 55 57)
(69 66 65 62 59)
(80 81 83 84 87)
(62 65 68 71 74)
(56 53 52 50 47)
(36 39 42 43 45 47 49)
(68 65 64 62 60 57 54)
(78 75 73 71 69 67 65 63)
(50 52 54 55 57 59 60)
(73 72 71 70 69 67)
(99 96 93 90 87)
(34 32 31 28 27 24 22)
(78 81 82 84 85 87 88)
(37 35 34 33 30)
(70 69 68 65 63 62)
(85 82 80 77 75 74 72 69)
(33 35 38 41 42)
(67 64 62 60 58)
(38 36 35 34 31 30)
(64 67 69 71 74 77)
(89 86 83 80 79 77)
(80 77 75 74 71)
(76 79 82 83 86)
(92 89 86 85 84 82 79 77)
(14 17 20 22 25 28)
(23 26 27 29 32 35 36)
(99 98 96 93 90 87 84)
(41 43 44 47 49 52 53 56)
(25 24 21 19 16 13 11)
(46 49 52 54 56)
(68 65 62 61 58)
(73 70 68 65 62 61 60)
(42 43 45 48 49)
(61 64 67 70 72 74)
(71 72 73 74 75 76)
(89 86 84 81 79 76 73 72)
(48 46 45 42 39 36 34 32)
(66 63 61 59 56 55 53)
(18 20 22 24 27 30 33)
(50 49 47 46 44)
(69 70 71 74 75 78 79)
(18 16 13 12 11 8 7)
(57 59 60 62 64 67)
(25 27 29 32 35)
(71 68 67 65 64 61 58)
(21 22 24 26 29 32 34 37)
(89 87 85 82 79 78 75)
(91 89 87 85 82 81 78)
(77 79 81 82 85 86)
(59 61 62 65 67 68)
(94 93 92 91 90 87 85 83)
(50 52 53 54 56 57 58 61)
))
#+end_src

#+begin_src elisp
(car raw_input2)
#+end_src

#+RESULTS:
| 1 | 4 | 5 | 8 | 11 | 12 | 9 |



*** Claude Solution

Let's break this down into steps:

1. First, let's write a helper function to check if adjacent differences are valid (between 1 and 3):

#+begin_src elisp
(defun valid-differences (nums)
  (cl-loop for (a b) on nums by #'cdr
           while b
           for diff = (abs (- b a))
           always (and (> diff 0) (<= diff 3))))
#+end_src

2. Then check if numbers are strictly increasing or decreasing:

#+begin_src elisp
(defun strictly-monotonic (nums)
  (or (cl-loop for (a b) on nums by #'cdr
               while b
               always (> b a))
      (cl-loop for (a b) on nums by #'cdr
               while b
               always (< b a))))
#+end_src

3. Combine these into a safe-report predicate:

#+begin_src elisp
(defun safe-report-p (nums)
  (and (valid-differences nums)
       (strictly-monotonic nums)))
#+end_src


4. Count the safe reports:

#+begin_src elisp
(setq safe-count
      (cl-count-if #'safe-report-p raw_input2))
#+end_src

This solution uses:
- =cl-loop= with =by #'cdr= to iterate over pairs
- Predicates combined with =and=
- =cl-count-if= to count matches
- Pattern matching with =(a b)= to destructure pairs
- Short-circuiting with =always=

The Python equivalent might look like:

#+begin_src python
def valid_differences(nums):
    return all(0 < abs(b - a) <= 3 for a, b in zip(nums, nums[1:]))

def strictly_monotonic(nums):
    return all(b > a for a, b in zip(nums, nums[1:])) or \
           all(b < a for a, b in zip(nums, nums[1:]))

def safe_report(nums):
    return valid_differences(nums) and strictly_monotonic(nums)

safe_count = sum(1 for nums in raw_input2 if safe_report(nums))
#+end_src

* Part 2

We'll need to check if removing any single number makes the sequence valid:

#+begin_src elisp
(defun safe-with-removal-p (nums)
  (or (safe-report-p nums)  ; First check if already safe
      (cl-loop for i from 0 below (length nums)
               ;; Create new list without element at i
               for test-nums = (append (cl-subseq nums 0 i)
                                     (cl-subseq nums (1+ i)))
               thereis (safe-report-p test-nums))))

(setq safe-count-with-removal
      (cl-count-if #'safe-with-removal-p raw_input2))
#+end_src


** Note on =thereis= syntax of the =cl-loop= macro, from Emacs Common Lisp Lisp Emulation Manual [[info:cl#Iteration Clauses][cl#Iteration Clauses]]

#+begin_quote
‘thereis CONDITION’
     This clause stops the loop when the specified form is non-‘nil’; in
     this case, it returns that non-‘nil’ value.  If all the values were
     ‘nil’, the loop returns ‘nil’.
#+end_quote

** Explanation
1. First checks if sequence is already safe
2. If not, tries removing each number one at a time:
   - Uses =cl-subseq= to slice the list before and after index
   - =append= to join the slices
   - =thereis= to return true if any attempt succeeds

The Python equivalent would be:

#+begin_src python
def safe_with_removal(nums):
    if safe_report(nums):
        return True
    return any(safe_report(nums[:i] + nums[i+1:]) 
              for i in range(len(nums)))

safe_count = sum(1 for nums in raw_input2 
                if safe_with_removal(nums))
#+end_src

Let's test both parts together:

#+begin_src elisp
(list 
 (cl-count-if #'safe-report-p raw_input2)         ; Part 1
 (cl-count-if #'safe-with-removal-p raw_input2))  ; Part 2
#+end_src

** Full Code

#+begin_src elisp
(defun valid-differences (nums)
  (cl-loop for (a b) on nums by #'cdr
           while b
           for diff = (abs (- b a))
           always (and (> diff 0) (<= diff 3))))

(defun strictly-monotonic (nums)
  (or (cl-loop for (a b) on nums by #'cdr
               while b
               always (> b a))
      (cl-loop for (a b) on nums by #'cdr
               while b
               always (< b a))))

(defun safe-report-p (nums)
  (and (valid-differences nums)
       (strictly-monotonic nums)))

(defun safe-with-removal-p (nums)
  (or (safe-report-p nums)  ; First check if already safe
      (cl-loop for i from 0 below (length nums)
               ;; Create new list without element at i
               for test-nums = (append (cl-subseq nums 0 i)
                                     (cl-subseq nums (1+ i)))
               thereis (safe-report-p test-nums))))

(setq safe-count-with-removal
      (cl-count-if #'safe-with-removal-p raw_input2))

(list 
 (cl-count-if #'safe-report-p raw_input2)         ; Part 1
 (cl-count-if #'safe-with-removal-p raw_input2))  ; Part 2
#+end_src

